Revit 2024 API
UIApplication.ProductIsRS Property
 Identifies if the current Revit product has an RS designation. Most add-ins will not need to use this information.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public bool ProductIsRS { get; }
Visual Basic
Public ReadOnly Property ProductIsRS As Boolean
	Get
Visual C++
public:
property bool ProductIsRS {
	bool get ();
}
See Also
UIApplication Class
Autodesk.Revit.UI Namespace